package com.renfakai.cpcn.dict;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * 中金支付请求的类型
 *
 * @author renfakai
 */
@Getter
@AllArgsConstructor
public enum CpcnRequestType {

    /**
     * 4530-机构支付账户单笔代付
     */
    TX_4510_REQUEST("4510", "4510-机构支付账户余额查询"),

    /**
     * 4530-机构支付账户单笔代付
     */
    TX_4530_REQUEST("4530", "4530-机构支付账户单笔代付"),

    /**
     * 4532-机构支付账户单笔代付查询
     */
    TX_4532_REQUEST("4532", "4532-机构支付账户单笔代付查询"),

    /**
     * 2820-支付查询
     */
    TX_2820_REQUEST("2820", "2820-支付查询"),


    /**
     * 2841-订单关闭
     */
    TX_2841_REQUEST("2841", "2841-订单关闭"),

    /**
     * 2811-扫码支付
     */
    TX_2811_REQUEST("2811", "2811-扫码支付"),

    /**
     * 2813-公众号支付
     */
    TX_2813_REQUEST("2813", "2813-公众号支付"),

    /**
     * 2814-APP支付
     */
    TX_2814_REQUEST("2814", "2814-APP支付"),

    /**
     * 2531-建立绑定关系(发送验证短信)
     */
    TX_2531_REQUEST("2531", "2531-建立绑定关系"),

    /**
     * 2532-建立绑定关系(验证并绑定)
     */
    TX_2532_REQUEST("2532", "2532-建立绑定关系"),

    /**
     * 2532-建立绑定关系(验证并绑定)
     */
    TX_2340_REQUEST("2340", "2340-四要素验证"),

    /**
     * 2532-建立绑定关系(验证并绑定)
     */
    TX_2320_REQUEST("2320", "2320-身份验证"),


    /**
     * 2911-电子回单下载
     */
    TX_2911_REQUEST("2911", "2911-电子回单下载"),

    /**
     * 2011-单笔代扣请求
     */
    TX_2011_REQUEST("2011", "2011-单笔代扣请求"),

    /**
     * 2020-单笔代扣交易查询
     */
    TX_2020_REQUEST("2020", "2020-单笔代扣交易查询"),

    /**
     * 1620-批量代收查询
     */
    TX_1620_REQUEST("1620", "1620-批量代收查询"),
    /**
     * 1610-批量代收
     */
    TX_1610_REQUEST("1610", "1610-批量代收"),

    ;
    /**
     * code
     */
    private final String code;

    /**
     * 形容
     */
    private final String desc;
}
